# Numpy Tutorials

Numpy is a general purpose array-processing package. It porvides a high performance multidimensional aray object and tools for working with these arrays

In [1]:
## first we import numpy
import numpy as np

In [2]:
my_lst = [1,2,3,4]
arr = np.array(my_lst)

In [3]:
type(arr)

numpy.ndarray

In [4]:
arr.shape

(4,)

In [7]:
#create a 2-d array
my_lst1 = [1,2,3,4]
my_lst2 = [4,5,6,7]
my_lst3 = [7,8,9,10]
arr=np.array([my_lst1, my_lst2, my_lst3])

In [8]:
arr

array([[ 1,  2,  3,  4],
       [ 4,  5,  6,  7],
       [ 7,  8,  9, 10]])

In [9]:
arr.shape

(3, 4)

In [10]:
arr.reshape(4,3) #reshaped but not saved to arr

array([[ 1,  2,  3],
       [ 4,  4,  5],
       [ 6,  7,  7],
       [ 8,  9, 10]])

In [11]:
arr.shape #arr back to its originl form

(3, 4)

In [12]:
print(arr)

[[ 1  2  3  4]
 [ 4  5  6  7]
 [ 7  8  9 10]]

# Indexing in Numpy - Arrays

In [13]:
arr[2]

array([ 7,  8,  9, 10])

In [14]:
arr[0:,:]

array([[ 1,  2,  3,  4],
       [ 4,  5,  6,  7],
       [ 7,  8,  9, 10]])

In [16]:
arr[1:,2:]

array([[ 6,  7],
       [ 9, 10]])

In [22]:
newArr = np.arange(1,10, step = 2)
print(newArr)

[1 3 5 7 9]

In [23]:
arr1 = newArr.copy()

In [24]:
print(arr1)

[1 3 5 7 9]

In [26]:
# some conditions for Exploratory Data Analysis

val = 200
arr[arr<val]

array([ 1,  2,  3,  4,  4,  5,  6,  7,  7,  8,  9, 10])

In [27]:
arr*2

array([[ 2,  4,  6,  8],
       [ 8, 10, 12, 14],
       [14, 16, 18, 20]])

In [28]:
np.ones(4)
np.ones((2,5),dtype=int)

array([[1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1]])

In [29]:
#random distribution

np.random.rand(3,3)

array([[0.99439912, 0.6593272 , 0.33560557],
       [0.56791916, 0.54516676, 0.93142335],
       [0.79180048, 0.12629603, 0.81877894]])

In [31]:
np.arange(0,10).reshape(2,5)

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [36]:
np.random.randint(0,100, 8 ).reshape(2,4)  #random 8 integer values from 0 - 100

array([[54, 30, 28, 48],
       [34, 46, 86, 60]])

# Pandas 
Pandas is an open source library, high-perfromance, easy to use data analysis tool

 - What is data frames
 - what is data series 
 - Different operation in Pandas

In [2]:
pip install pandas

Collecting pandas
  Downloading pandas-1.5.1-cp39-cp39-win_amd64.whl (10.9 MB)
     ---------------------------------------- 10.9/10.9 MB 6.1 MB/s eta 0:00:00
Collecting pytz>=2020.1
  Downloading pytz-2022.6-py2.py3-none-any.whl (498 kB)
     -------------------------------------- 498.1/498.1 KB 7.9 MB/s eta 0:00:00
Collecting numpy>=1.20.3
  Downloading numpy-1.23.5-cp39-cp39-win_amd64.whl (14.7 MB)
     ---------------------------------------- 14.7/14.7 MB 5.8 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\dell\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.15.0)
Installing collected packages: pytz, numpy, pandas
  Attempting uninstall: numpy
    Found existing installation: numpy 1.19.5
    Uninstalling numpy-1.19.5:
      Successfully uninstalled numpy-1.19.5
Successfully installed numpy-1.23.5 pandas-1.5.1 pytz-2022.6
Note: you may need to restart the kernel to use updated packages.

ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
tensorflow 2.5.0 requires numpy~=1.19.2, but you have numpy 1.23.5 which is incompatible.
tensorflow-gpu 2.5.0 requires numpy~=1.19.2, but you have numpy 1.23.5 which is incompatible.
WARNING: You are using pip version 22.0.4; however, version 22.3.1 is available.
You should consider upgrading via the 'C:\Users\DELL\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [2]:
# first step to import pandas
import pandas as pd
import numpy as np

In [6]:
# creating dataframe

df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1','Row2','Row3','Row4','Row5'], columns = ['column1','column2', 'column3','column4'])

In [7]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [8]:
df.to_csv('Test1.csv') #convert dataframe to csv

In [15]:
# Accessing the elements of Row1

df.loc['Row1']

type(df.loc['Row1']) #series is one row or one column

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

In [25]:
df['column1'] #print values of a specific column

# df[['column1','column2']]

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: column1, dtype: int32

In [16]:
#iloc for specific data frame

df.iloc[:,1:]

      column2  column3  column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [17]:
#convert dataframe to arrays

df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [18]:
df['column1'].value_counts() #finds unique categories

0     1
4     1
8     1
12    1
16    1
Name: column1, dtype: int64

In [19]:
df.isnull().sum() #checks for null values in a column

column1    0
column2    0
column3    0
column4    0
dtype: int64

# Pandas - Reading csv and csv operations

In [14]:
# read csv file through pandas

df = pd.read_csv("US_E-commerce_records_2020.csv",encoding='windows-1252')

# df = pd.read_csv("US_E-commerce_records_2020.csv",encoding='windows-1252', sep = ";") # if separation is ";"

In [15]:
df.head()

,Order Date,Row ID,Order ID,Ship Mode,Customer ID,Segment,Country,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,01-01-20,849,CA-2017-107503,Standard Class,GA-14725,Consumer,United States,Lorain,Ohio,44052,East,FUR-FU-10003878,Furniture,Furnishings,"Linden 10"" Round Wall Clock, Black",48.896,4,0.2,8.5568
1,01-01-20,4010,CA-2017-144463,Standard Class,SC-20725,Consumer,United States,Los Angeles,California,90036,West,FUR-FU-10001215,Furniture,Furnishings,"Howard Miller 11-1/2"" Diameter Brentwood Wall ...",474.430,11,0.0,199.2606
2,01-01-20,6683,CA-2017-154466,First Class,DP-13390,Home Office,United States,Franklin,Wisconsin,53132,Central,OFF-BI-10002012,Office Supplies,Binders,Wilson Jones Easy Flow II Sheet Lifters,3.600,2,0.0,1.7280
3,01-01-20,8070,CA-2017-151750,Standard Class,JM-15250,Consumer,United States,Huntsville,Texas,77340,Central,OFF-ST-10002743,Office Supplies,Storage,SAFCO Boltless Steel Shelving,454.560,5,0.2,-107.9580
4,01-01-20,8071,CA-2017-151750,Standard Class,JM-15250,Consumer,United States,Huntsville,Texas,77340,Central,FUR-FU-10002116,Furniture,Furnishings,"Tenex Carpeted, Granite-Look or Clear Contempo...",141.420,5,0.6,-187.3815

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3312 entries, 0 to 3311
Data columns (total 19 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order Date    3312 non-null   object
 1   Row ID        3312 non-null   int64
 2   Order ID      3312 non-null   object
 3   Ship Mode     3312 non-null   object
 4   Customer ID   3312 non-null   object
 5   Segment       3312 non-null   object
 6   Country       3312 non-null   object
 7   City          3312 non-null   object
 8   State         3312 non-null   object
 9   Postal Code   3312 non-null   int64
 10  Region        3312 non-null   object
 11  Product ID    3312 non-null   object
 12  Category      3312 non-null   object
 13  Sub-Category  3312 non-null   object
 14  Product Name  3312 non-null   object
 15  Sales         3312 non-null   float64
 16  Quantity      3312 non-null   int64
 17  Discount      3312 non-null   float64
 18  Profit        3312 non-null   float64
dtypes: float64(3), int64(3), object(13)
memory usage: 491.8+ KB

In [17]:
df.describe()

,Row ID,Postal Code,Sales,Quantity,Discount,Profit
count,3312.000000,3312.000000,3312.000000,3312.000000,3312.000000,3312.000000
mean,5087.107488,56186.515097,221.381418,3.766908,0.156467,28.212340
std,2817.482266,31980.375516,585.257531,2.221776,0.207429,241.864342
min,13.000000,1841.000000,0.444000,1.000000,0.000000,-3839.990400
25%,2655.750000,27978.750000,17.018000,2.000000,0.000000,1.763200
50%,5183.500000,60472.500000,53.810000,3.000000,0.200000,8.296800
75%,7498.250000,90032.000000,205.105700,5.000000,0.200000,28.315125
max,9994.000000,99301.000000,13999.960000,14.000000,0.800000,6719.980800

In [18]:
 df["Ship Mode"].value_counts()  #count of unique values

Standard Class    1897
Second Class       657
First Class        572
Same Day           186
Name: Ship Mode, dtype: int64

In [19]:
#create data frame of specific column

df1 = pd.read_csv("US_E-commerce_records_2020.csv",encoding='windows-1252', usecols=['Quantity','Discount','Profit'] )

In [20]:
df1.head()

   Quantity  Discount    Profit
0         4       0.2    8.5568
1        11       0.0  199.2606
2         2       0.0    1.7280
3         5       0.2 -107.9580
4         5       0.6 -187.3815

In [21]:
df['Quantity'][2]

2

In [24]:
#create csv from string

from io import StringIO

data = ('a,b,c\n'
        '1,2,3\n'
        '4,5,6\n')
print(data)

a,b,c
1,2,3
4,5,6

In [25]:
pd.read_csv(StringIO(data))

   a  b  c
0  1  2  3
1  4  5  6

# Read Json to csv

In [18]:
data = {"employee_name":"Json", "email":"james@gmail.com", "job_profile":"Engineer"}
df1 = pd.DataFrame(data, index=[0]) 
print(df1)

  employee_name            email job_profile
0          Json  james@gmail.com    Engineer

In [17]:
df1.to_json() #it also takes index with the values

'{"employee_name":{"0":"Json"},"email":{"0":"james@gmail.com"},"job_profile":{"0":"Engineer"}}'

In [19]:
df1.to_json(orient="records") #this will give only records

'[{"employee_name":"Json","email":"james@gmail.com","job_profile":"Engineer"}]'

In [20]:
df1.to_csv("job.csv") #convert json to csv

# Read HTML Content - Web Scrapping Technique

In [21]:
url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list"

dfs = pd.read_html(url)

In [23]:
print(dfs[0]) 
# print(dfs)

                         Bank NameBank           CityCity StateSt  CertCert  \
0                    Almena State Bank             Almena      KS     15426
1           First City Bank of Florida  Fort Walton Beach      FL     16748
2                 The First State Bank      Barboursville      WV     14361
3                   Ericson State Bank            Ericson      NE     18265
4     City National Bank of New Jersey             Newark      NJ     21111
..                                 ...                ...     ...       ...
558                 Superior Bank, FSB           Hinsdale      IL     32646
559                Malta National Bank              Malta      OH      6629
560    First Alliance Bank & Trust Co.         Manchester      NH     34264
561  National State Bank of Metropolis         Metropolis      IL      3815
562                   Bank of Honolulu           Honolulu      HI     21029

                 Acquiring InstitutionAI Closing DateClosing  FundFund
0                            Equity Bank    October 23, 2020     10538
1              United Fidelity Bank, fsb    October 16, 2020     10537
2                         MVB Bank, Inc.       April 3, 2020     10536
3             Farmers and Merchants Bank   February 14, 2020     10535
4                        Industrial Bank    November 1, 2019     10534
..                                   ...                 ...       ...
558                Superior Federal, FSB       July 27, 2001      6004
559                    North Valley Bank         May 3, 2001      4648
560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
561              Banterra Bank of Marion   December 14, 2000      4646
562                   Bank of the Orient    October 13, 2000      4645

[563 rows x 7 columns]